src/DataProcessors/МассоваяРассылкаАктовСверок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МассоваяРассылкаАктовСверок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтараяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылатьПоставщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылатьПокупателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЕслиНетДолгов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяОрганизацияТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаБезКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДляСписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/МассоваяРассылкаАктовСверок/Ext/ObjectModule.bsl
Перем ТабДок, Секция;

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Если Не РассылатьПокупателям И Не РассылатьПоставщикам Тогда 
	//	Отказ = Истина;
	//	Сообщить("Выберите хотя бы один вид контрагентов для рассылки: поставщиков или покупателей");
	//КонецЕсли;
	Если СтараяОрганизацияТребуется Тогда 
		ПроверяемыеРеквизиты.Добавить("СтараяОрганизация");
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьРассылку() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	Контрагенты.ОсновнойДоговорКонтрагента.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ОсновнойДоговорКонтрагента.Организация В(&Организация)
	               |	И Контрагенты.Покупатель
	               |	И ВЫБОР
	               |			КОГДА &ВидДоговора = 1
	               |				ТОГДА Контрагенты.ОсновнойДоговорКонтрагента.ДоговорПриостановлен
	               |			КОГДА &ВидДоговора = 2
	               |				ТОГДА НЕ Контрагенты.ОсновнойДоговорКонтрагента.ДоговорПриостановлен
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация", Организации.ВыгрузитьКолонку(0));
	//Запрос.УстановитьПараметр("РассылатьПокупателям", РассылатьПокупателям);
	//Запрос.УстановитьПараметр("РассылатьПоставщикам", РассылатьПоставщикам);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если СтараяОрганизацияТребуется Тогда 
		ОтсеятьПоСтаройОрганизации(Таблица);
	КонецЕсли;
	
	//Если Не ВыгружатьЕслиНетДолгов Тогда 
	//	ОтсеятьБезДолгов(Таблица);
	//КонецЕсли;
	Таблица.Колонки.Добавить("Отослан", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Булево")); 
	Таблица.Колонки.Добавить("ТекстОшибки", ОбщегоНазначения.ОписаниеТипаСтрока(300));
	
	СверТаблица = Таблица.Скопировать(, "Контрагент");
	СверТаблица.Свернуть("Контрагент");
	Для Каждого СтрокаСв Из СверТаблица Цикл 
		Строки = Таблица.НайтиСтроки(Новый Структура("Контрагент", СтрокаСв.Контрагент));
		Для Каждого СтрокаТЧ Из Строки Цикл 
			СтруктураОтчета = СформироватьОтчет(СтрокаТЧ.Контрагент, СтрокаТЧ.Организация);
			СтрокаТЧ.Отослан = ОтослатьПоПочте(СтруктураОтчета);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураОтчета, "Ошибка, ТекстОшибки");
			Если СтрокаТЧ.Ошибка Тогда 
				СтрокаТЧ.ТекстОшибки = "Ошибка: " + СтрокаТЧ.ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//#Если Клиент Тогда 
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда 	
		СформироватьТабличныйДокумент(Таблица);
	КонецЕсли;
	//#КонецЕсли
КонецПроцедуры

Процедура ОтсеятьПоСтаройОрганизации(Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДоговорыКонтрагентов.Владелец
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.Владелец В
	               |			(ВЫБРАТЬ
	               |				Таблица.Контрагент
	               |			ИЗ
	               |				Таблица)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация
	               |ПОМЕСТИТЬ вт2
	               |ИЗ
	               |	Таблица КАК Таблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО Таблица.Контрагент = вт.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт2.Контрагент,
	               |	вт2.Организация
	               |ИЗ
	               |	вт2 КАК вт2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вт2.Контрагент,
	               |	&Организация
	               |ИЗ
	               |	вт2 КАК вт2";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Организация", СтараяОрганизация);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция  СформироватьОтчет(Контрагент, Организация)
	
	СтруктураОтчета = Новый Структура("Ошибка,ТекстОшибки", Ложь, "");
	СтруктураОтчета.Вставить("Организация", Организация);
	СтруктураОтчета.Вставить("Контрагент", Контрагент);
	СтруктураОтчета.Вставить("Договор", Неопределено);
	СтруктураОтчета.Вставить("НачалоПериода", НачалоПериода);
	СтруктураОтчета.Вставить("ОкончаниеПериода", КонецПериода);
	СтруктураОтчета.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
	
	Отчет = Отчеты.АктСверкиВзаиморасчетов.Создать();
	Отчет.ЗаполнитьАктСверки(СтруктураОтчета);
	
	Возврат СтруктураОтчета;
	
КонецФункции

Функция  ОтослатьПоПочте(СтруктураОтчета)
	
	Если Не СтруктураОтчета.Ошибка Тогда 		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтактнаяИнформация.Представление КАК Адрес
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Вид = &ВидЭмейл
		               |	И КонтактнаяИнформация.Представление <> """"";
		Запрос.УстановитьПараметр("Объект", СтруктураОтчета.Контрагент);
		Запрос.УстановитьПараметр("ВидЭмейл", Справочники.ВидыКонтактнойИнформации.EmailДляОбменаДокументамиСКонтрагентами);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			СтруктураОтчета.Ошибка = Истина;
			СтруктураОтчета.ТекстОшибки = "У контрагента" + СтруктураОтчета.Контрагент + " нет адреса для обмена документами";
			Возврат Ложь;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
				
		Параметры = Новый Структура;
		Параметры.Вставить("Отчет", СтруктураОтчета.ТабличныйДокумент);
		Параметры.Вставить("ШаблонПисьма", Справочники.ШаблоныТекстовПисем.ПустаяСсылка());
		Параметры.Вставить("ВидТекстаПисьма", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
		Параметры.Вставить("АдресЭлектроннойПочтыКонтрагента", Выборка.Адрес);
		Параметры.Вставить("ОбъектПечати", СтруктураОтчета.Контрагент);
		Параметры.Вставить("ВложенияHTML", Ложь);
		Параметры.Вставить("ВложенияTXT", Ложь);
		Параметры.Вставить("ВложенияXLS", Истина);
		Параметры.Вставить("ВложенияMXL", Ложь);
		Параметры.Вставить("ИмяФайлаВложения", "Акт сверки взаиморасчетов");
		Параметры.Вставить("ТемаСообщения", "Акт сверки взаиморасчетов");
		Параметры.Вставить("ЗаполнятьТекстПисьма", Истина);
        Попытка
			Если ВыгружатьЕслиНетДолгов Или СтруктураОтчета.Сальдо <> 0 Тогда  
				УправлениеЭлектроннойПочтой.ОтправитьОтчет(Параметры);
				Возврат Истина;
			Иначе
				СтруктураОтчета.ТекстОшибки = "Нет долгов";
			КонецЕсли;
		Исключение
			СтруктураОтчета.Ошибка = Истина;
			СтруктураОтчета.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СформироватьТабличныйДокумент(Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация,
	               |	Таблица.Отослан,
	               |	Таблица.Ошибка,
	               |	Таблица.ТекстОшибки
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация,
	               |	Таблица.Отослан,
	               |	Таблица.Ошибка,
	               |	Таблица.ТекстОшибки
	               |ИЗ
	               |	Таблица КАК Таблица
	               |ИТОГИ ПО
	               |	Таблица.Контрагент";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
    ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	
	Секция = ТабДок.ПолучитьОбласть("R2");
    ТабДок.НачатьАвтогруппировкуСтрок();
    ПечатьДерева (Дерево,,Дерево.Колонки);
    ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ПоместитьВоВременноеХранилище(ТабДок, Адрес);
	//ТабДок.Показать();
КонецПроцедуры

Процедура ПечатьДерева ( СтрокаДерева,Уровень = 0,Колонки)
    Для Каждого стр Из СтрокаДерева.Строки Цикл
        НомерКолонки = 0;
        отступ = "";
        Для н = 1 По Уровень Цикл   
            отступ = отступ + " ";
        КонецЦикла;
        Для Каждого КЛ Из Колонки Цикл
            НомерКолонки = НомерКолонки + 1;
            Секция.Область(1, НомерКолонки).Текст = ?(НомерКолонки = 1, отступ+стр[КЛ.Имя], стр[КЛ.Имя]);
        КонецЦикла;
        ТабДок.Вывести(Секция,Уровень+1);
        ПечатьДерева(стр,Уровень+1,Колонки);
    КонецЦикла;
КонецПроцедуры
